
`{"tf":"plan","lock":"false","chdir":"stacks/sample_instance","var-file":"env/stg.tfvars"}`

<!-- pre_output -->


<details><summary>Outline of changes.</summary>

```diff
! aws_instance.sample must be replaced
```
</details>

<details><summary>Plan: 1 to add, 0 to change, 1 to destroy.</br>

###### TF Sample by @dependabot[bot] via [pull_request](https://github.com/DevSecTop/TF-via-PR/actions/runs/9738571481/job/26872373684) at 2024-07-01T05:14:23Z.</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.sample must be replaced
-/+ resource "aws_instance" "sample" {
      ~ ami                                  = "ami-0226b5ec3281d5d20" -> "ami-0ef73863dbddaa97f" # forces replacement
      ~ arn                                  = "arn:aws:ec2:eu-west-2:813676077823:instance/i-0e9d528510804ad97" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "eu-west-2b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0e9d528510804ad97" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0cb64398d4f2db7b0" -> (known after apply)
      ~ private_dns                          = "ip-172-31-45-131.eu-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.45.131" -> (known after apply)
      ~ public_dns                           = "ec2-35-178-177-132.eu-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "35.178.177.132" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "default",
        ] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-0bf931268b087c338" -> (known after apply)
        tags                                 = {
            "Name" = "sample-instance"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0ccdf62a72e1b2e3f",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 1 -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - tags_all              = {
              - "Environment" = "Undefined"
              - "Stack"       = "sample_instance"
              - "Terraform"   = "default"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0a10cdbe8b7f8922d" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ sample_instance_id = "i-0e9d528510804ad97" -> (known after apply)
```
</details>

<!-- post_output -->

<!-- 241stacks-sample-instanceenv-stg-tfvarsterraform-tfplan -->